Revit 2026 API

# UnifiedBitmapTextureURepeat Property

---

The property labeled "U Repeat" from the "UnifiedBitmap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureURepeat { get; }
```
```vb
Public Shared ReadOnly Property TextureURepeat As String
	Get
```
```cpp
public:
static property String^ TextureURepeat {
	String^ get ();
}
```
```fsharp
static member TextureURepeat : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

UnifiedBitmap Class

Autodesk.Revit.DB.Visual Namespace